# Pandas GroupBy

Splitting : It is a process in which we split data into group by applying some conditions on datasets.
Applying : It is a process in which we apply a function to each group independently
Combining : It is a process in which we combine different datasets after applying groupby and results into a data structure

Groupby concept. 
1. Group the unique values from the Team column 
2. Now thereâ€™s a bucket for each group
3. Toss the other data into the buckets 
4. Apply a function on the weight column of each bucket.

obj.groupby(key)
obj.groupby(key, axis=1)
obj.groupby([key1, key2])

In [45]:
import pandas as pd
import numpy as np

# Grouping data with one key:

In [4]:

data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
        'Age':[27, 24, 22, 32, 
               33, 36, 27, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA']} 
df = pd.DataFrame(data1)
df

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

In [9]:
var =df.groupby("Name")
print(var.groups)

{'Abhi': [7], 'Anuj': [1, 5], 'Gaurav': [4], 'Jai': [0, 2], 'Princi': [3, 6]}

Now we print the first entries in all the groups formed.

In [10]:
var.first()#printing the first occurance

        Age  Address Qualification
Name
Abhi     32  Aligarh            MA
Anuj     24   Kanpur            MA
Gaurav   33  Jaunpur        B.Tech
Jai      27   Nagpur           Msc
Princi   32  Kannuaj           Phd

# Grouping data with multiple keys :

In [13]:
var1 = df.groupby(["Name","Qualification"])
var1

In [15]:
var1.groups

{('Abhi', 'MA'): [7], ('Anuj', 'B.com'): [5], ('Anuj', 'MA'): [1], ('Gaurav', 'B.Tech'): [4], ('Jai', 'MCA'): [2], ('Jai', 'Msc'): [0], ('Princi', 'Msc'): [6], ('Princi', 'Phd'): [3]}

# Grouping data by sorting keys :

In [18]:
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
        'Age':[27, 24, 22, 32, 
               33, 36, 27, 32], } 
df = pd.DataFrame(data1)
df

     Name  Age
0     Jai   27
1    Anuj   24
2     Jai   22
3  Princi   32
4  Gaurav   33
5    Anuj   36
6  Princi   27
7    Abhi   32

In [22]:
df.groupby("Name").sum()# without using sort

        Age
Name
Abhi     32
Anuj     60
Gaurav   33
Jai      49
Princi   59

In [23]:
df.groupby("Name",sort = False).sum()# without using sort

        Age
Name
Jai      49
Anuj     60
Princi   59
Gaurav   33
Abhi     32

# Grouping data with object attributes

In [25]:
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
        'Age':[27, 24, 22, 32, 
               33, 36, 27, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA']} 
    
  
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1)
  
print(df)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

In [31]:
var2 = df.groupby("Name")
var2

# Iterating through groups

In [32]:
for name,group in var2:
    print(name)
    print(group)
    print()

Abhi
   Name  Age  Address Qualification
7  Abhi   32  Aligarh            MA

Anuj
   Name  Age Address Qualification
1  Anuj   24  Kanpur            MA
5  Anuj   36  Kanpur         B.com

Gaurav
     Name  Age  Address Qualification
4  Gaurav   33  Jaunpur        B.Tech

Jai
  Name  Age    Address Qualification
0  Jai   27     Nagpur           Msc
2  Jai   22  Allahabad           MCA

Princi
     Name  Age    Address Qualification
3  Princi   32    Kannuaj           Phd
6  Princi   27  Allahabad           Msc

# Selecting a groups

GroupBy.get_group(). We can select a group by applying a function GroupBy.get_group this function select a single group.

In [37]:
grp = df.groupby("Name")
grp.get_group("Jai")

  Name  Age    Address Qualification
0  Jai   27     Nagpur           Msc
2  Jai   22  Allahabad           MCA

In [39]:
grp.get_group("Princi")

     Name  Age    Address Qualification
3  Princi   32    Kannuaj           Phd
6  Princi   27  Allahabad           Msc

In [43]:
grp = df.groupby(["Name","Qualification"])
grp.get_group(("Jai","Msc"))

  Name  Age Address Qualification
0  Jai   27  Nagpur           Msc

In [46]:
grp1 = df.groupby('Name')
 
grp1.aggregate(np.sum)

        Age           Address Qualification
Name
Abhi     32           Aligarh            MA
Anuj     60      KanpurKanpur       MAB.com
Gaurav   33           Jaunpur        B.Tech
Jai      49   NagpurAllahabad        MscMCA
Princi   59  KannuajAllahabad        PhdMsc

In [47]:
 
grp = df.groupby('Name')
 
grp['Age'].agg([np.sum, np.mean, np.std])

        sum  mean       std
Name
Abhi     32  32.0       NaN
Anuj     60  30.0  8.485281
Gaurav   33  33.0       NaN
Jai      49  24.5  3.535534
Princi   59  29.5  3.535534

# Grouping Rows in pandas

In [48]:
example = {'Team':['Arsenal', 'Manchester United', 'Arsenal', 
                   'Arsenal', 'Chelsea', 'Manchester United', 
                   'Manchester United', 'Chelsea', 'Chelsea', 'Chelsea'], 
                     
           'Player':['Ozil', 'Pogba', 'Lucas', 'Aubameyang', 
                       'Hazard', 'Mata', 'Lukaku', 'Morata',  
                                         'Giroud', 'Kante'], 
                                           
           'Goals':[5, 3, 6, 4, 9, 2, 0, 5, 2, 3] } 
  
df = pd.DataFrame(example) 
  
print(df)

                Team      Player  Goals
0            Arsenal        Ozil      5
1  Manchester United       Pogba      3
2            Arsenal       Lucas      6
3            Arsenal  Aubameyang      4
4            Chelsea      Hazard      9
5  Manchester United        Mata      2
6  Manchester United      Lukaku      0
7            Chelsea      Morata      5
8            Chelsea      Giroud      2
9            Chelsea       Kante      3

In [64]:
total_goals = df['Goals'].groupby(df["Team"])
total_goals.mean()

Team
Arsenal              5.000000
Chelsea              4.750000
Manchester United    1.666667
Name: Goals, dtype: float64

In [66]:
example = {'Team':['Australia', 'England', 'South Africa', 
                   'Australia', 'England', 'India', 'India', 
                        'South Africa', 'England', 'India'], 
                          
           'Player':['Ricky Ponting', 'Joe Root', 'Hashim Amla', 
                     'David Warner', 'Jos Buttler', 'Virat Kohli', 
                     'Rohit Sharma', 'David Miller', 'Eoin Morgan', 
                                                 'Dinesh Karthik'], 
                                                   
          'Runs':[345, 336, 689, 490, 989, 672, 560, 455, 342, 376], 
            
          'Salary':[34500, 33600, 68900, 49000, 98899, 
                    67562, 56760, 45675, 34542, 31176] } 
  
df = pd.DataFrame(example) 
df

           Team          Player  Runs  Salary
0     Australia   Ricky Ponting   345   34500
1       England        Joe Root   336   33600
2  South Africa     Hashim Amla   689   68900
3     Australia    David Warner   490   49000
4       England     Jos Buttler   989   98899
5         India     Virat Kohli   672   67562
6         India    Rohit Sharma   560   56760
7  South Africa    David Miller   455   45675
8       England     Eoin Morgan   342   34542
9         India  Dinesh Karthik   376   31176

In [68]:
total_Salary = df['Salary'].groupby(df["Team"])
total_Salary.mean()

Team
Australia       41750.000000
England         55680.333333
India           51832.666667
South Africa    57287.500000
Name: Salary, dtype: float64